# ShowArrowheadToCutMark Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ShowArrowheadToCutMark Property
ParameterTypeId Class See Also
---
"Show Arrowhead to Cut Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ShowArrowheadToCutMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ShowArrowheadToCutMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ShowArrowheadToCutMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace